;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; mbr.asm
; 主引导程序，位于硬盘的 0 扇区
; 主板会自动加载该主引导程序
; 加载地址是 0x7c00
; 该文件的主要作用是加载存放在2扇区的 loader 程序
; loader 程序最长占4个扇区空间
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

; mbr loader 默认加载地址是 0x7c00
section mbr vstart=0x7c00

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; 利用0x10中断的0x06子功能清空屏幕
; 参考 https://zh.wikipedia.org/wiki/INT_10H
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  mov ah, 0x06
  mov al, 0
  ; 左上角字符的行号
  mov ch, 0
  ; 左上角字符的列号
  mov cl, 0
  ; 右下角字符的行号
  mov dh, 24
  ; 右下角字符的列号
  mov dl, 79
  int 0x10

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; 利用0x10中断的0x03子功能获取光标位置
;   参数:
;     ah: 子功能号
;     bh: 待获取光标的页号
;   返回:
;     ch: 光标开始行
;     cl: 光标结束行
;     dh: 光标所在行号
;     dl: 光标所在列号
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  mov ah, 0x03
  mov bh, 0
  int 0x10

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; 利用0x10中断的13号子功能打印字符串
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ; es:bp 为字符串起始地址, es此时同cs一致
  mov ax, message
  mov bp, ax

  ; cx 记录字符串长度，不包括结束符 0
  mov cx, 5
  ; 设置字符显示属性
  mov ax, 0x1301
  mov bx, 0x2

  int 0x10

  jmp $

  message db "1 MBR"
  times 510-($-$$) db 0
  db 0x55, 0xaa
